#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_ecr_authorization_token.token: Reading...
module.lambda_container_image.data.aws_region.current: Reading...
module.lambda_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.docker_image.data.aws_region.current: Reading...
module.lambda_container_image.data.aws_caller_identity.current: Reading...
module.lambda_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.lambda_container_image.data.aws_partition.current: Reading...
data.aws_caller_identity.this: Reading...
module.docker_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.lambda_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.api_gateway.data.aws_route53_zone.this[0]: Reading...
module.lambda_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.docker_image.data.aws_caller_identity.this: Reading...
module.lambda_container_image.data.aws_caller_identity.current: Read complete after 0s [id=070576557102]
data.aws_caller_identity.this: Read complete after 0s [id=070576557102]
module.lambda_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.lambda_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=3509441685]
module.docker_image.data.aws_caller_identity.this: Read complete after 0s [id=070576557102]
data.aws_ecr_authorization_token.token: Read complete after 1s [id=us-east-1]
module.api_gateway.data.aws_route53_zone.this[0]: Read complete after 1s [id=Z00402303DMA4KDX72AUO]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_dynamodb_table.basic-dynamodb-table will be created
  + resource "aws_dynamodb_table" "basic-dynamodb-table" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "demo_id"
      + id               = (known after apply)
      + name             = "demo"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Service" = "demo_service"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "Project"     = "APIGatewayLambdaDockerDynamoDBDemo"
          + "Service"     = "demo_service"
          + "Terraform"   = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "demo_id"
          + type = "S"
        }
    }

  # random_string.this will be created
  + resource "random_string" "this" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.api_gateway.aws_apigatewayv2_api.this[0] will be created
  + resource "aws_apigatewayv2_api" "this" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + description                  = "Demo api gateway to lambda container image"
      + disable_execute_api_endpoint = true
      + execution_arn                = (known after apply)
      + fail_on_warnings             = false
      + id                           = (known after apply)
      + name                         = "dev-demo_service"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags                         = {
          + "Service"               = "demo_service"
          + "terraform-aws-modules" = "apigateway-v2"
        }
      + tags_all                     = {
          + "Environment"           = "dev"
          + "Project"               = "APIGatewayLambdaDockerDynamoDBDemo"
          + "Service"               = "demo_service"
          + "Terraform"             = "true"
          + "terraform-aws-modules" = "apigateway-v2"
        }

      + cors_configuration {
          + allow_headers = [
              + "authorization",
              + "content-type",
              + "x-amz-date",
              + "x-amz-security-token",
              + "x-amz-user-agent",
              + "x-api-key",
            ]
          + allow_methods = [
              + "*",
            ]
          + allow_origins = [
              + "*",
            ]
        }
    }

  # module.api_gateway.aws_apigatewayv2_api_mapping.this[0] will be created
  + resource "aws_apigatewayv2_api_mapping" "this" {
      + api_id      = (known after apply)
      + domain_name = (known after apply)
      + id          = (known after apply)
      + stage       = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_domain_name.this[0] will be created
  + resource "aws_apigatewayv2_domain_name" "this" {
      + api_mapping_selection_expression = (known after apply)
      + arn                              = (known after apply)
      + domain_name                      = "*.awseducate.systems"
      + id                               = (known after apply)
      + tags                             = {
          + "Service" = "demo_service"
        }
      + tags_all                         = {
          + "Environment" = "dev"
          + "Project"     = "APIGatewayLambdaDockerDynamoDBDemo"
          + "Service"     = "demo_service"
          + "Terraform"   = "true"
        }

      + domain_name_configuration {
          + certificate_arn                        = (known after apply)
          + endpoint_type                          = "REGIONAL"
          + hosted_zone_id                         = (known after apply)
          + ownership_verification_certificate_arn = (known after apply)
          + security_policy                        = "TLS_1_2"
          + target_domain_name                     = (known after apply)
        }
    }

  # module.api_gateway.aws_apigatewayv2_integration.this["$default"] will be created
  + resource "aws_apigatewayv2_integration" "this" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_integration.this["ANY /"] will be created
  + resource "aws_apigatewayv2_integration" "this" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = 29000
    }

  # module.api_gateway.aws_apigatewayv2_integration.this["GET /demo"] will be created
  + resource "aws_apigatewayv2_integration" "this" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = 29000
    }

  # module.api_gateway.aws_apigatewayv2_route.this["$default"] will be created
  + resource "aws_apigatewayv2_route" "this" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "$default"
      + target             = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_route.this["ANY /"] will be created
  + resource "aws_apigatewayv2_route" "this" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "ANY /"
      + target             = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_route.this["GET /demo"] will be created
  + resource "aws_apigatewayv2_route" "this" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "GET /demo"
      + target             = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_stage.this[0] will be created
  + resource "aws_apigatewayv2_stage" "this" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "dev"
      + tags          = {
          + "Service" = "demo_service"
        }
      + tags_all      = {
          + "Environment" = "dev"
          + "Project"     = "APIGatewayLambdaDockerDynamoDBDemo"
          + "Service"     = "demo_service"
          + "Terraform"   = "true"
        }

      + access_log_settings {
          + destination_arn = (known after apply)
          + format          = jsonencode(
                {
                  + context = {
                      + domainName              = "$context.domainName"
                      + error                   = {
                          + message      = "$context.error.message"
                          + responseType = "$context.error.responseType"
                        }
                      + identity                = {
                          + sourceIP = "$context.identity.sourceIp"
                        }
                      + integration             = {
                          + error             = "$context.integration.error"
                          + integrationStatus = "$context.integration.integrationStatus"
                        }
                      + integrationErrorMessage = "$context.integrationErrorMessage"
                      + protocol                = "$context.protocol"
                      + requestId               = "$context.requestId"
                      + requestTime             = "$context.requestTime"
                      + responseLength          = "$context.responseLength"
                      + routeKey                = "$context.routeKey"
                      + stage                   = "$context.stage"
                      + status                  = "$context.status"
                    }
                }
            )
        }

      + default_route_settings {
          + data_trace_enabled       = false
          + detailed_metrics_enabled = true
          + logging_level            = (known after apply)
          + throttling_burst_limit   = 100
          + throttling_rate_limit    = 100
        }

      + route_settings {
          + data_trace_enabled       = false
          + detailed_metrics_enabled = false
          + logging_level            = (known after apply)
          + route_key                = "ANY /"
          + throttling_burst_limit   = 100
          + throttling_rate_limit    = 100
        }
      + route_settings {
          + data_trace_enabled       = false
          + detailed_metrics_enabled = true
          + logging_level            = (known after apply)
          + route_key                = "$default"
          + throttling_burst_limit   = 100
          + throttling_rate_limit    = 100
        }
      + route_settings {
          + data_trace_enabled       = false
          + detailed_metrics_enabled = true
          + logging_level            = (known after apply)
          + route_key                = "GET /demo"
          + throttling_burst_limit   = 40
          + throttling_rate_limit    = 80
        }
    }

  # module.api_gateway.aws_cloudwatch_log_group.this["this"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/apigateway/dev-demo_service/dev"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Service" = "demo_service"
        }
      + tags_all          = {
          + "Environment" = "dev"
          + "Project"     = "APIGatewayLambdaDockerDynamoDBDemo"
          + "Service"     = "demo_service"
          + "Terraform"   = "true"
        }
    }

  # module.api_gateway.aws_route53_record.this["dev-demo-service-internal-api-tpet-A"] will be created
  + resource "aws_route53_record" "this" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "dev-demo-service-internal-api-tpet"
      + type            = "A"
      + zone_id         = "Z00402303DMA4KDX72AUO"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.api_gateway.aws_route53_record.this["dev-demo-service-internal-api-tpet-AAAA"] will be created
  + resource "aws_route53_record" "this" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "dev-demo-service-internal-api-tpet"
      + type            = "AAAA"
      + zone_id         = "Z00402303DMA4KDX72AUO"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.docker_image.aws_ecr_lifecycle_policy.this[0] will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep only the last 10 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 10
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = (known after apply)
    }

  # module.docker_image.aws_ecr_repository.this[0] will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = (known after apply)
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "Environment" = "dev"
          + "Project"     = "APIGatewayLambdaDockerDynamoDBDemo"
          + "Terraform"   = "true"
        }

      + image_scanning_configuration {
          + scan_on_push = false
        }
    }

  # module.docker_image.docker_image.this will be created
  + resource "docker_image" "this" {
      + force_remove = false
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = false
      + name         = (known after apply)
      + repo_digest  = (known after apply)
      + triggers     = {
          + "dir_sha" = "d60e9dac17ad8bbaee484e6cef8e0a79ba64ed32"
        }

      + build {
          + cache_from     = []
          + context        = "."
          + dockerfile     = "./Dockerfile"
          + extra_hosts    = []
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (11 unchanged attributes hidden)
        }
    }

  # module.docker_image.docker_registry_image.this will be created
  + resource "docker_registry_image" "this" {
      + id                   = (known after apply)
      + insecure_skip_verify = false
      + keep_remotely        = true
      + name                 = (known after apply)
      + sha256_digest        = (known after apply)
      + triggers             = {
          + "dir_sha" = "d60e9dac17ad8bbaee484e6cef8e0a79ba64ed32"
        }
    }

  # module.lambda_container_image.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.lambda_container_image.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = (known after apply)
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "dev"
          + "Service"     = "demo_service"
          + "Terraform"   = "true"
        }
      + tags_all          = {
          + "Environment" = "dev"
          + "Project"     = "APIGatewayLambdaDockerDynamoDBDemo"
          + "Service"     = "demo_service"
          + "Terraform"   = "true"
        }
    }

  # module.lambda_container_image.aws_iam_policy.additional_inline[0] will be created
  + resource "aws_iam_policy" "additional_inline" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "dynamodb:UpdateItem",
                          + "dynamodb:Scan",
                          + "dynamodb:Query",
                          + "dynamodb:PutItem",
                          + "dynamodb:GetItem",
                          + "dynamodb:DeleteItem",
                          + "dynamodb:BatchWriteItem",
                          + "dynamodb:BatchGetItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:us-east-1:070576557102:table/demo"
                      + Sid      = "dynamodbcrud"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "Service"     = "demo_service"
          + "Terraform"   = "true"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "Project"     = "APIGatewayLambdaDockerDynamoDBDemo"
          + "Service"     = "demo_service"
          + "Terraform"   = "true"
        }
    }

  # module.lambda_container_image.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "Service"     = "demo_service"
          + "Terraform"   = "true"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "Project"     = "APIGatewayLambdaDockerDynamoDBDemo"
          + "Service"     = "demo_service"
          + "Terraform"   = "true"
        }
    }

  # module.lambda_container_image.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "Service"     = "demo_service"
          + "Terraform"   = "true"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "Project"     = "APIGatewayLambdaDockerDynamoDBDemo"
          + "Service"     = "demo_service"
          + "Terraform"   = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.lambda_container_image.aws_iam_role_policy_attachment.additional_inline[0] will be created
  + resource "aws_iam_role_policy_attachment" "additional_inline" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.lambda_container_image.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.lambda_container_image.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = [
          + "x86_64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "This is a demo, for lambda container image"
      + function_name                  = (known after apply)
      + id                             = (known after apply)
      + image_uri                      = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "dev"
          + "Service"               = "demo_service"
          + "Terraform"             = "true"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "dev"
          + "Project"               = "APIGatewayLambdaDockerDynamoDBDemo"
          + "Service"               = "demo_service"
          + "Terraform"             = "true"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ENVIRONMENT" = "dev"
              + "SERVICE"     = "demo_service"
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }
    }

  # module.lambda_container_image.aws_lambda_permission.current_version_triggers["AllowExecutionFromAPIGateway"] will be created
  + resource "aws_lambda_permission" "current_version_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + qualifier           = (known after apply)
      + source_arn          = (known after apply)
      + statement_id        = (known after apply)
      + statement_id_prefix = "AllowExecutionFromAPIGateway"
    }

  # module.lambda_container_image.aws_lambda_permission.unqualified_alias_triggers["AllowExecutionFromAPIGateway"] will be created
  + resource "aws_lambda_permission" "unqualified_alias_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = (known after apply)
      + statement_id_prefix = "AllowExecutionFromAPIGateway"
    }

  # module.api_gateway.module.acm.aws_acm_certificate.this[0] will be created
  + resource "aws_acm_certificate" "this" {
      + arn                       = (known after apply)
      + domain_name               = "awseducate.systems"
      + domain_validation_options = [
          + {
              + domain_name           = "*.awseducate.systems"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "awseducate.systems"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.awseducate.systems",
          + "awseducate.systems",
        ]
      + tags                      = {
          + "Service" = "demo_service"
        }
      + tags_all                  = {
          + "Environment" = "dev"
          + "Project"     = "APIGatewayLambdaDockerDynamoDBDemo"
          + "Service"     = "demo_service"
          + "Terraform"   = "true"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options {
          + certificate_transparency_logging_preference = "ENABLED"
        }
    }

  # module.api_gateway.module.acm.aws_acm_certificate_validation.this[0] will be created
  + resource "aws_acm_certificate_validation" "this" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)

      + timeouts {}
    }

  # module.api_gateway.module.acm.aws_route53_record.validation[0] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z00402303DMA4KDX72AUO"
    }

Plan: 31 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @sh1un, Action: `pull_request`*